Revit 2026 API

# AnalysisDisplayDeformedShapeSettings Class

---

Contains deformed shape settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayDeformedShapeSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayDeformedShapeSettings : IDisposable
```
```vb
Public Class AnalysisDisplayDeformedShapeSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayDeformedShapeSettings : IDisposable
```
```fsharp
type AnalysisDisplayDeformedShapeSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayDeformedShapeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayDeformedShapeSettings | Constructs a default instance of deformed shape settings. |
|  | AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) | Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | GridColor | Color of grid lines. |
|  | GridLineWeight | Line weight of grid lines. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in deformed shape. |
|  | ShowContourLines | If true, show contour lines in the analysis display. |
|  | ShowGridLines | If true, show grid lines in the analysis display. |
|  | TextLabelType | Type of deformed shape text visualization. |
|  | TextTypeId | Element id of text associated with the settings. |
|  | Transparency | Transparency percentage of deformed shape color fill on surfaces |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalysisDisplayDeformedShapeSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Compares two deformed shape settings objects. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace